In [153]:
import pandas as pd
import numpy as np
from sqlalchemy import text, create_engine
from env import get_connection

Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

4. Use your function to obtain a connection to the employees database.

In [155]:
url = get_connection('employees')

In [154]:
url = get_connection

In [156]:
engine = create_engine(url)

In [157]:
query = '''
        SELECT *
        FROM employees
        '''

In [158]:
text_query = text(query)

In [159]:
df = pd.read_sql(text_query, engine.connect())
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

5. Once you have successfully run a query:
    

a. Intentionally make a typo in the database url. What kind of error message do you see?

6. Read the employees and titles tables into two separate DataFrames.

In [160]:
titles = text('''
        SELECT * FROM titles
        ''')
t = pd.read_sql(titles,engine.connect())
t.head(3)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [29]:
e.info()

NameError: name 'e' is not defined

#30024

Display the summary statistics for each DataFrame.

In [ ]:
e.describe()

How many unique titles are in the titles DataFrame?

In [11]:
t['title'].nunique()

7

What is the oldest date in the to_date column?

In [16]:
t.sort_values(by='to_date',ascending=True).head(3)

        emp_no     title   from_date     to_date
16064    20869  Engineer  1985-02-17  1985-03-01
406358  474918  Engineer  1985-02-10  1985-03-11
346216  434232     Staff  1985-02-26  1985-03-20

What is the most recent date in the to_date column?

In [ ]:

dt = t['to_date'] != datetime.date(9999, 1, 1)
t[dt].sort_values(by='to_date',ascending=False).head(3)

#EXERCISE II

Copy the users and roles DataFrames from the examples above.

In [33]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [34]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [35]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role
0  1.0      bob      1.0      admin
1  2.0      joe      2.0     author
2  3.0    sally      3.0   reviewer
3  4.0     adam      3.0   reviewer
4  5.0     jane      NaN        NaN
5  6.0     mike      NaN        NaN
6  NaN      NaN      4.0  commenter

In [36]:
right_joined_df = users.merge(roles, left_on='role_id', right_on='id', how='right')
right_joined_df

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

What is the result of using an outer join on the DataFrames?

In [37]:
outer_joined_df = users.merge(roles, left_on='role_id', right_on='id', how='outer')
outer_joined_df

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [39]:
merged_df = users.merge(roles)
merged_df

Empty DataFrame
Columns: [id, name, role_id]
Index: []

Load the mpg dataset from PyDataset.

In [42]:
from pydataset import data

In [43]:
mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [47]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

Output and read the documentation for the mpg dataset.

In [48]:
mpg_dataset = data('mpg', show_doc=True)
mpg_dataset

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

How many rows and columns are in the dataset?

In [58]:
num_rows, num_columns = mpg.shape
print("Number of rows :", num_rows)
print("Number of columns :", num_columns)

Number of rows : 234
Number of columns : 11

Check out your column names and perform any cleanup you may want on them.

In [59]:
mpg.columns = mpg.columns.str.strip().str.lower()
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

Display the summary statistics for the dataset.

In [167]:
 mpg.describe()

,displ,year,cyl,cty,hwy,mileage_difference,average_mileage
count,234.000000,234.000000,234.000000,234.000000,234.000000,234.000000,234.000000
mean,3.471795,2003.500000,5.888889,16.858974,23.440171,6.581197,20.149573
std,1.291959,4.509646,1.611534,4.255946,5.954643,2.262739,5.050290
min,1.600000,1999.000000,4.000000,9.000000,12.000000,2.000000,10.500000
25%,2.400000,1999.000000,4.000000,14.000000,18.000000,5.000000,15.500000
50%,3.300000,2003.500000,6.000000,17.000000,24.000000,7.000000,20.500000
75%,4.600000,2008.000000,8.000000,19.000000,27.000000,8.000000,23.500000
max,7.000000,2008.000000,8.000000,35.000000,44.000000,12.000000,39.500000

How many different manufacturers are there?

In [61]:
mpg['manufacturer'].nunique()

15

How many different models are there?

In [62]:
mpg['model'].nunique()

38

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [165]:
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty']
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [66]:
mpg['average_mileage'] = (mpg['cty'] + mpg['hwy']) / 2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [67]:
mpg['is_automatic'] = np.where(mpg['trans'].str.startswith('auto'), True, False)
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [69]:
avg_mpg_manufacturer = mpg.groupby('manufacturer')['average_mileage'].mean()
avg_mpg_manufacturer

manufacturer
audi          22.027778
chevrolet     18.447368
dodge         15.540541
ford          16.680000
honda         28.500000
hyundai       22.750000
jeep          15.562500
land rover    14.000000
lincoln       14.166667
mercury       15.625000
nissan        21.346154
pontiac       21.700000
subaru        22.428571
toyota        21.720588
volkswagen    25.074074
Name: average_mileage, dtype: float64

In [71]:
best_manufacturer = avg_mpg_by_manufacturer.idxmax()
best_manufacturer

'honda'

In [72]:
best_mpg_value = avg_mpg_by_manufacturer.max()
best_mpg_value

28.5

Do automatic or manual cars have better miles per gallon?

In [73]:
avg_mpgtransmission = mpg.groupby('is_automatic')['average_mileage'].mean()
avg_mpgtransmission

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

#EXERCISE III

Use your get_db_url function to help you explore the data from the chipotle database.

In [75]:
url = get_connection('chipotle')

In [76]:
engine = create_engine(url)

In [ ]:
#query = '''
    #    SELECT *
     # SHOW TABLES [we can do this so we dont have to go to sql workbenhc to know where to work]
      #  FROM orders
        
      #  '''

In [136]:
query = '''
        SELECT *
        FROM orders
        '''

In [81]:
text_query = text(query)

In [108]:
df = pd.read_sql(text_query, engine.connect())
df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

What is the total price for each order?

In [ ]:
df['total_price'] = df.item_price

In [140]:
total_price_per_order = df.groupby('order_id')['item_price'].sum()
total_price_per_order

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

What are the most popular 3 items?

In [141]:
item_popularity = df.groupby('item_name')['quantity'].sum().head(3)
item_popularity

item_name
6 Pack Soft Drink    55
Barbacoa Bowl        66
Barbacoa Burrito     91
Name: quantity, dtype: int64

In [142]:
 item_popularity.sort_values(ascending=False)

item_name
Barbacoa Burrito     91
Barbacoa Bowl        66
6 Pack Soft Drink    55
Name: quantity, dtype: int64

Which item has produced the most revenue?

In [168]:
result = chipotle_df.assign(revenue=chipotle_df.eval('quantity * item_price')).groupby('item_name')['revenue'].sum().idxmax()
result

'Chicken Bowl'

In [145]:
result = chipotle_df.assign(revenue=chipotle_df.eval('quantity * item_price')).groupby('item_name')['revenue'].sum().idxmax()
result

'Chicken Bowl'

Join the employees and titles DataFrames together.

In [ ]:
merge_df = df.merge(employees, left_on = 'titles', right_on = 'employees', how = 'inner')
merge_df